Revit 2024 API
ConnectionInputPoint Constructor
 Construct a default input point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ConnectionInputPoint()
Visual Basic
Public Sub New
Visual C++
public:
ConnectionInputPoint()
See Also
ConnectionInputPoint Class
ConnectionInputPoint Overload
Autodesk.Revit.DB.Structure Namespace